studium/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="sv" xml:lang="sv">
<head>
<!-- 2023-03-31 fre 06:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gnu-Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Johan Sandén" />
<link rel="stylesheet" type="text/css" href="../css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Gnu-Emacs</h1>
<div class="org-center">
<p>
<a href="studium.html">Studium</a> | <a href="../index.html">Hjälp! - ta mig härifrån</a>
</p>
</div>

<div id="outline-container-orge9ea483" class="outline-2">
<h2 id="orge9ea483">Introduktion</h2>
<div class="outline-text-2" id="text-orge9ea483">
<blockquote>
<p>
"Emacs is the extensible, customizable, self-documenting real-time display editor."
</p>
</blockquote>

<p>
Emacs är en textredigeriare. Den är gjord av och för programmerare som vill
kunna påverka nästan alla asspekter av det verktyg de jobbar i.
</p>

<p>
Emacs kan ta lite tid att lära sig. Öppnar man en textfil eller om dagen så är
det mer än väl värt besväret.
</p>

<p>
En av anledningarna till Emacs kan ta lite längre tid att lära sig är att några
av de ord som normalt används för att beskriva Emacs skiljer sig från andra
program. Det i sin tur beror på att Emacs har sina rötter i det tidiga 70-talet,
långt innan persondatorn blev vanlig och grafiska gränssnitt var vanliga.
</p>
</div>
</div>

<div id="outline-container-org67640cc" class="outline-2">
<h2 id="org67640cc">Ladda ner och installera Emacs</h2>
<div class="outline-text-2" id="text-org67640cc">
<ul class="org-ul">
<li>Emacs kan hämtas på: <a href="http://www.gnu.org/software/emacs/">http://www.gnu.org/software/emacs/</a></li>
<li>Kör du linux rekommenderar jag att du tar emacs från din normala
pakethanterare.</li>
<li>Installera Emacs som vilket program som helst.</li>
<li>I home (windows %userprofile%) kommer Emacs att leta efter en fil som
heter ".emacs". Där konfigurationen ligger.</li>
</ul>
</div>
</div>

<div id="outline-container-org3b2329c" class="outline-2">
<h2 id="org3b2329c">Start och stoppa Emacs</h2>
<div class="outline-text-2" id="text-org3b2329c">
<ul class="org-ul">
<li>Emacs startas som alla andra program. I ett fönstersystem (Windows, IOS
eller X) kommer Emacs att startas som alla andra program, i ett fönster.
Står man i en terminal kan man starta med flaggan "-nw" (no window).</li>
<li>Man avslutar emacs med kommandot <code>C-x C-c</code>. Det innebär att man håller
inne <code>Ctrl</code>-knappen och trycker <code>x</code>, man fortsätter hålla <code>Ctrl</code>-knappen
nedtryckt och trycker <code>c</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-org3b122b3" class="outline-2">
<h2 id="org3b122b3">Grundläggande definitioner</h2>
<div class="outline-text-2" id="text-org3b122b3">
<ul class="org-ul">
<li>Buffer (sv. buffert):: Innehållet i ett "window" (ofta en textfil) kallas
för "buffer". En buffer kan också innehålla text som inte ligger på en fil,
en terminal eller output från ett program som en webläsare e.d.</li>
<li id="Frame (sv. Ram)">Rutan som kommer upp på skärmen, som innehåller hela
programmet när man startar Emacs, kallas för "Frame" (inte Window, som är
vanligt).</li>
<li id="Window (sv. fönster)">Om man delar en Frame i två eller tre delar, så
kallas varje del en "window" (man kan dela av en frame hur många gånger man
vill)</li>
<li id="POINT">Markörens position i en buffer.</li>
</ul>
</div>
</div>

<div id="outline-container-org7d46d63" class="outline-2">
<h2 id="org7d46d63">Några grundläggande kommandon</h2>
<div class="outline-text-2" id="text-org7d46d63">
<ul class="org-ul">
<li><code>M-x</code> (Meta-x) betyder att man ska hålla ner <code>Alt</code>-knappen (eller
<code>Esc</code>-knappen) och sedan trycka <code>x</code>.
<ul class="org-ul">
<li>Just kommandot <code>M-x</code> används för att exekvera den interaktiva funktionen
execute-extended-command som kör alla andra interaktiva funktioner.</li>
</ul></li>
<li><code>C-x</code> betyder att man ska hålla ner <code>Ctrl</code>-knappen, hålla den nedtryckt
medans man trycker <code>x</code>.
<ul class="org-ul">
<li>Just kommandot <code>C-x</code> används för att köra många olika övergripande
kommandon.</li>
</ul></li>
<li><code>C-x h</code>. Betyder att man ska Hålla ner <code>Ctrl</code> och trycka <code>x</code>, släppa <code>Ctrl</code>
och trycker ner <code>h</code> ensamt.</li>
<li><code>C-x C-m</code> betyder betyder att man först håller ner <code>Ctrl</code> och sedan trycker
<code>x</code>, fortsätter hålla <code>Ctrl</code>-knappen nedtryckt och sedan trycker <code>m</code>. Man
behöver alltså inte släppa Ctrl-knappen mellan tryckningarna.</li>
</ul>
</div>

<div id="outline-container-orgba3ead7" class="outline-3">
<h3 id="orgba3ead7">Filer</h3>
<div class="outline-text-3" id="text-orgba3ead7">
<dl class="org-dl">
<dt><code>C-x C-f</code></dt><dd>find-file - läsa in en fil i Emacs</dd>
<dt><code>C-x C-s</code></dt><dd>save-buffer - spara en fil på skivminne</dd>
<dt><code>C-x C-w</code></dt><dd>write-file - skriv buffertens innehåll på en namngiven fil</dd>
<dt><code>C-x i</code></dt><dd>insert-file - sätt in innehållet från en annan fil i bufferten</dd>
<dt><code>C-x C-v</code></dt><dd>find-alternate-file - läs in en ny fil i bufferten</dd>
<dt><code>C-x d</code></dt><dd>list-directory - starta Dired, katalogeditorn</dd>
</dl>
</div>
</div>

<div id="outline-container-orge083d23" class="outline-3">
<h3 id="orge083d23">Hjälp!</h3>
<div class="outline-text-3" id="text-orge083d23">
<p>
Hjälpsystemet är mycket enkelt. Tryck på <code>C-h</code> och följ instruktionerna. Om du är
nybörjare, tryck <code>C-h t</code> för att få en demonstration. Alla hjälptexter är på
engelska.
</p>

<dl class="org-dl">
<dt><code>C-x 1</code></dt><dd>ta bort hjälpfönstret</dd>
<dt><code>ESC C-v</code></dt><dd>bläddra i hjälpfönstret</dd>
<dt><code>C-h a</code></dt><dd>apropos: sök med hjälp av text</dd>
<dt><code>C-h c</code></dt><dd>visa en tangents funktion</dd>
<dt><code>C-h f</code></dt><dd>beskriv en funktion</dd>
<dt><code>C-h m</code></dt><dd>få information om den aktuella moden</dd>
</dl>
</div>
</div>

<div id="outline-container-orge82e697" class="outline-3">
<h3 id="orge82e697">Let's panic!!</h3>
<div class="outline-text-3" id="text-orge82e697">
<dl class="org-dl">
<dt><code>C-g</code></dt><dd>avbryt delvis angivet kommando</dd>
<dt><code>M-x recover-file</code></dt><dd>rädda en fil efter en krasch</dd>
<dt><code>C-x u</code> eller <code>C-_</code></dt><dd>ångra en oönskad ändring</dd>
<dt><code>M-x revert-buffer</code></dt><dd>återgå till senaste sparade versionen</dd>
<dt><code>C-l</code></dt><dd>rita om skärmen</dd>
</dl>
</div>
</div>

<div id="outline-container-orgd30063d" class="outline-3">
<h3 id="orgd30063d">Sökning</h3>
<div class="outline-text-3" id="text-orgd30063d">
<dl class="org-dl">
<dt><code>C-s</code></dt><dd>sökning framåt</dd>
<dt><code>C-r</code></dt><dd>sökning bakåt</dd>
<dt><code>C-M-s</code></dt><dd>sökning med hjälp av reguljära uttryck</dd>
</dl>

<p>
Använd <code>C-s</code> eller <code>C-r</code> upprepade gånger för att upprepa sökningen eller
upprepa den i någon riktning. <code>ESC</code> avsluta sökningen DEL ångra senaste
tangenttryckningen <code>C-g</code> avbryt sökningen
</p>

<p>
Om Emacs fortfarande söker så avslutar <code>C-g</code> den sökning Emacs just då håller
på med, i annat fall avbryts hela sökningen.
</p>
</div>
</div>

<div id="outline-container-org783e3df" class="outline-3">
<h3 id="org783e3df">Redigering</h3>
<div class="outline-text-3" id="text-org783e3df">
<p>
Copy/Paste fungerar lite annorlunda i Emacs jämfört med windows och andra
system. Man markerar med <code>C-&lt;space&gt;</code>. Kopierar med <code>M-w</code> (kill-ring-save),
klipper ut med <code>C-w</code> (kill-region) och klistrar in med <code>C-y</code> (yank). Det som
klipps ut eller raderas läggs in i "kill-ring", ett minne med urklipp.
Eftersom killring kan inehålla äldre urklipp så når man dem med <code>M-y</code> efter
en den första <code>C-y</code>.
</p>

<dl class="org-dl">
<dt><code>C-SPACE</code></dt><dd>markera (sätt märket här)</dd>
<dt><code>C-k</code></dt><dd>raderar raden.</dd>
<dt><code>C-w</code></dt><dd>klipp ut. (radera och spara i kill-ring)</dd>
<dt><code>M-w</code></dt><dd>kopiera (spara i kill-ring)</dd>
<dt><code>M-y</code></dt><dd>ersätt senast raderade text med ännu äldre</dd>
<dt><code>C-x h</code></dt><dd>Markerar hela buffer.</dd>
<dt><code>M-q</code></dt><dd>jämna till stycket</dd>
</dl>
</div>
</div>

<div id="outline-container-org092dc33" class="outline-3">
<h3 id="org092dc33">Flera fönster</h3>
<div class="outline-text-3" id="text-org092dc33">
<dl class="org-dl">
<dt><code>C-x 1</code></dt><dd>göm alla fönster utom det du står i.</dd>
<dt><code>C-x 0</code></dt><dd>gömmer fönstret du står i.</dd>
<dt><code>C-x 2</code></dt><dd>dela fönstret i två delar, horisontellt</dd>
<dt><code>C-x 3</code></dt><dd>dela fönstret i två delar, vertikalt</dd>
<dt><code>C-x o</code></dt><dd>flytta markören till ett annat fönster</dd>
<dt><code>C-x ^</code></dt><dd>gör fönstret längre</dd>
<dt><code>C-x {</code></dt><dd>gör fönstret smalare</dd>
<dt><code>C-x }</code></dt><dd>gör fönstret bredare</dd>
</dl>
</div>
</div>

<div id="outline-container-org83033ba" class="outline-3">
<h3 id="org83033ba">Undo/Upprepa</h3>
<div class="outline-text-3" id="text-org83033ba">
<dl class="org-dl">
<dt><code>C-x u</code></dt><dd>ångra.</dd>
<dt><code>C-x z</code></dt><dd>upprepa (<code>C-z</code> <code>z</code> <code>z</code> <code>z</code>) för att upprepar 3 gånger.
<ul class="org-ul">
<li>Nästan alla kommandon kan upperpas, inte bara undo.</li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-org71348b4" class="outline-3">
<h3 id="org71348b4">Buffertar</h3>
<div class="outline-text-3" id="text-org71348b4">
<dl class="org-dl">
<dt><code>C-x b</code></dt><dd>gå till en annan buffert</dd>
<dt><code>C-x C-b</code></dt><dd>lista alla buffertar</dd>
<dt><code>C-x k</code></dt><dd>ta bort en buffert</dd>
</dl>
</div>
</div>

<div id="outline-container-org666f7b9" class="outline-3">
<h3 id="org666f7b9">Stavningskontroll</h3>
<div class="outline-text-3" id="text-org666f7b9">
<dl class="org-dl">
<dt><code>M-$</code></dt><dd>kontrollera stavningen av ett ord</dd>
<dt><code>M-x</code> spell-region</dt><dd>kontrollera stavningen av området</dd>
<dt><code>M-x</code> spell-buffer</dt><dd>kontrollera stavningen i bufferten</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org4ae54b8" class="outline-2">
<h2 id="org4ae54b8">Länkar och mer läsning</h2>
<div class="outline-text-2" id="text-org4ae54b8">
<dl class="org-dl">
<dt>GnuEmacs Officiella Websida</dt><dd><a href="https://www.gnu.org/software/emacs/">https://www.gnu.org/software/emacs/</a></dd>
<dt>GnuEmacs Engelsk Wiki</dt><dd><a href="https://en.wikipedia.org/wiki/GNU_Emacs">https://en.wikipedia.org/wiki/GNU_Emacs</a></dd>
<dt>Emacs Engelska Wiki</dt><dd><a href="https://en.wikipedia.org/wiki/Emacs">https://en.wikipedia.org/wiki/Emacs</a></dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Datum: 2023-03-31 fre 06:33</p>
<p class="author">F&ouml;rfattare: Johan Sandén</p>
<p class="date">Created: 2023-03-31 fre 06:33</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
